### <font color='red'>Pandas</font>: pandas is an open source python library designed for data manipulation and analysis .it provides powerful and flexible data structures, in form of series and DataFrame.

In [1]:
import pandas as pd
import numpy as np

In [ ]:
# Yanhan se baki sab NOTE me likha hua hai

In [3]:
#dataframe
d={'name':['vishnu','ram','sita','hari','krishna','radhey'],'Roll':[21,22,23,24,26,27],'age':[23,24,19,22,20,21]}
d

{'name': ['vishnu', 'ram', 'sita', 'hari', 'krishna', 'radhey'],
 'Roll': [21, 22, 23, 24, 26, 27],
 'age': [23, 24, 19, 22, 20, 21]}

In [4]:
#dictionary to DataFrame
df= pd.DataFrame(d)
df

      name  Roll  age
0   vishnu    21   23
1      ram    22   24
2     sita    23   19
3     hari    24   22
4  krishna    26   20
5   radhey    27   21

In [5]:
df.head()

      name  Roll  age
0   vishnu    21   23
1      ram    22   24
2     sita    23   19
3     hari    24   22
4  krishna    26   20

In [7]:
df.head(2) ## df(n)-print the n number of rows of the data frame from the beginning

     name  Roll  age
0  vishnu    21   23
1     ram    22   24

In [10]:
df.tail() #By deafult niche se 5 rows ko print karta hai

      name  Roll  age
1      ram    22   24
2     sita    23   19
3     hari    24   22
4  krishna    26   20
5   radhey    27   21

In [11]:
df.tail(3)

      name  Roll  age
3     hari    24   22
4  krishna    26   20
5   radhey    27   21

In [12]:
#rename
df = df.rename(columns={'name':'Student_Name'})
df

  Student_Name  Roll  age
0       vishnu    21   23
1          ram    22   24
2         sita    23   19
3         hari    24   22
4      krishna    26   20
5       radhey    27   21

In [13]:
df.Student_Name[4]

'krishna'

In [14]:
#set index
df.set_index('Roll')

     Student_Name  age
Roll
21         vishnu   23
22            ram   24
23           sita   19
24           hari   22
26        krishna   20
27         radhey   21

In [17]:
#df.set_index('Roll',inplace=True)
#df

In [57]:
d = pd.DataFrame({'Days':[1,2,3,4,5,6],'Places':['kendrapada','bhadrak','nayagarh',np.NaN,'konark','puri'],'visiters':[100,4000,5000,10,5000,9900000]})
d

   Days      Places  visiters
0     1  kendrapada       100
1     2     bhadrak      4000
2     3    nayagarh      5000
3     4         NaN        10
4     5      konark      5000
5     6        puri   9900000

In [58]:
#check missing values
d.isnull()

    Days  Places  visiters
0  False   False     False
1  False   False     False
2  False   False     False
3  False    True     False
4  False   False     False
5  False   False     False

In [60]:
d.isnull().sum()

Days        0
Places      1
visiters    0
dtype: int64

In [61]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Days      6 non-null      int64
 1   Places    5 non-null      object
 2   visiters  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [62]:
#fillna
d.Places.fillna('koraput',inplace=True)
d

   Days      Places  visiters
0     1  kendrapada       100
1     2     bhadrak      4000
2     3    nayagarh      5000
3     4     koraput        10
4     5      konark      5000
5     6        puri   9900000

In [63]:
#d=d.replace(np.NaN,'Puri')  --- ye ak alag tarika hai 
#d

In [64]:
import warnings
warnings.filterwarnings('ignore')

In [66]:
d.visiters.replace(10,5555,inplace=True)
d

   Days      Places  visiters
0     1  kendrapada       100
1     2     bhadrak      4000
2     3    nayagarh      5000
3     4     koraput      5555
4     5      konark      5000
5     6        puri   9900000

In [67]:
d.Places.unique()

array(['kendrapada', 'bhadrak', 'nayagarh', 'koraput', 'konark', 'puri'],
      dtype=object)

In [68]:
d.visiters.mean()

1653275.8333333333

In [70]:
d.max()

Days              6
Places         puri
visiters    9900000
dtype: object

In [71]:
d.describe()

           Days      visiters
count  6.000000  6.000000e+00
mean   3.500000  1.653276e+06
std    1.870829  4.040054e+06
min    1.000000  1.000000e+02
25%    2.250000  4.250000e+03
50%    3.500000  5.000000e+03
75%    4.750000  5.416250e+03
max    6.000000  9.900000e+06

In [72]:
d.describe(include='all')

            Days      Places      visiters
count   6.000000           6  6.000000e+00
unique       NaN           6           NaN
top          NaN  kendrapada           NaN
freq         NaN           1           NaN
mean    3.500000         NaN  1.653276e+06
std     1.870829         NaN  4.040054e+06
min     1.000000         NaN  1.000000e+02
25%     2.250000         NaN  4.250000e+03
50%     3.500000         NaN  5.000000e+03
75%     4.750000         NaN  5.416250e+03
max     6.000000         NaN  9.900000e+06

In [74]:
d.describe(include='O')

            Places
count            6
unique           6
top     kendrapada
freq             1

In [ ]:
#To download pre-built free databases
#1. uci machine learning repository
#2. kaggle